{
  "education": [
    {
      "school": "Universidade Federal de Minas Gerais",
      "course": "Bacharelado, Ciência da Computação",
      "period": "mai de 2021 - dez de 2025"
    },
    {
      "school": "Centro Federal de Educação Tecnológica de Minas Gerais",
      "course": "Formação técnica, Informática",
      "period": "fev de 2017 - dez de 2019"
    }
  ],
  "research": {
    "publications": [],
    "talks": []
  },
  "projects": [
    {
      "title": "Carcara",
      "link": "https://github.com/ufmg-smite/carcara",
      "description": "Carcara is a proof checker and elaborator for SMT proofs in the Alethe format. It is mainly maintained by the members of the SMITE group from the Computer Science Department at UFMG."
    },
    {
      "title": "cvc5",
      "link": "https://github.com/cvc5/cvc5",
      "description": "cvc5 is a tool for determining the satisfiability of a first order formula modulo a first order theory (or a combination of such theories). It is the fifth in the Cooperating Validity Checker family of tools (CVC, CVC Lite, CVC3, CVC4) but does not directly incorporate code from any previous version prior to CVC4."
    },
    {
      "title": "simple-cdcl",
      "link": "https://github.com/vinisilvag/simple-cdcl",
      "description": "A simple Python implementation of the Conflict-Driven Clause Learning (CDCL) algorithm for solving SAT problems. The implementation incorporates the 2-watched literals technique and the VSIDS decision heuristic. This project was developed as part of the course Theory and Practice of SMT Solving at UFMG."
    },
    {
      "title": "GRASP + PR heuristic for the Graph Coloring Problem",
      "link": "https://github.com/vinisilvag/gcp-heuristics",
      "description": "Research project focused on investigating the performance of a Greedy Randomized Adaptive Search Procedure (GRASP) heuristic with Path-Relinking applied to the Graph Coloring Problem. This project was developed as part of the course Heurísticas e Metaheurísticas at UFMG."
    }
  ],
  "work": [
    {
      "position": "Undergraduate research student",
      "place": "Departamento de Ciência da Computação - UFMG",
      "period": "jul de 2023 - o momento",
      "description": "I worked on the integration of the SMT solver cvc5 with the proof checker Carcara, enabling the production and verification of proofs in the Alethe format during the solver's regression tests. I'm currently working on extending Carcara with support for new theories, using techniques from the literature, in order to enable it to verify a broader set of Alethe proofs."
    },
    {
      "position": "Fullstack developer",
      "place": "Zeester",
      "period": "set de 2021 - mar de 2023",
      "description": "I contributed to the development and maintenance of a customer management dashboard, working on the frontend with ReactJS and on the backend with Node.js, both in TypeScript, within a microservices architecture integrated with MongoDB. My role included implementing new features, fixing bugs, and ensuring platform stability. I also developed a client onboarding platform with a complete payment flow, integrating secure gateways and database synchronization."
    },
    {
      "position": "Mobile developer",
      "place": "Geobyte Consultoria e Tecnologia GIS",
      "period": "fev de 2021 - jul de 2021",
      "description": "I developed and maintained cross-platform applications used for data collection in remote areas. Additionally, I implemented an offline-first strategy in the applications to ensure data persistence in locations without network coverage or internet access."
    },
    {
      "position": "Fullstack developer",
      "place": "Comp Júnior",
      "period": "abr de 2020 - out de 2021",
      "description": "I worked as a full-stack developer on several projects during my time at Comp, with a stronger focus on back-end development. Additionally, I assisted the infrastructure team in reviewing and modernizing the deployment strategy used and was one of the organizers and content creators for an internal training program on mobile development using JavaScript, React Native, and Expo."
    }
  ]
}